[
  {
    "title": "The Women",
    "author": "Kristin Hannah",
    "description": "An intimate portrait of coming of age in a dangerous time and an epic tale of a nation divided. Women can be heroes. When twenty-year-old nursing student Frances “Frankie” McGrath hears these words, it is a revelation[^1^][23].",
    "genre": "Historical Fiction, Fiction, Audiobook, Historical, War, Adult, Book Club",
    "latest_edition_year": "2024",
    "cover_image_link": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689788358i/127305853.jpg"
  },
  {
    "title": "Funny Story",
    "author": "Emily Henry",
    "description": "A shimmering, joyful new novel about a pair of opposites with the wrong thing in common. Daphne always loved the way her fiancé Peter told their story. How they met (on a blustery day), fell in love (over an errant hat), and moved back to his lakeside hometown to begin their life together[^2^][19].",
    "genre": "Not available",
    "latest_edition_year": "2024",
    "cover_image_link": "https://m.media-amazon.com/images/I/71PSVpqu3vL._SL1500_.jpg"
  },
  {
    "title": "Swift River",
    "author": "Essie Chambers",
    "description": "It’s the summer of 1987 and 16-year-old Diamond Newberry is an outcast in her small New England town, and the only Black person living there since her dad disappeared seven years ago. She begins receiving letters from a relative on her father’s side that unearth her family history[^3^][6].",
    "genre": "Fiction, Historical Fiction, Coming Of Age, Adult, Fiction, Family, Historical, Contemporary",
    "latest_edition_year": "2024",
    "cover_image_link": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1717087530i/199798557.jpg"
  },
  {
    "title": "Same as It Ever Was",
    "author": "Claire Lombardo",
    "description": "At 57, Julia Ames is an almost empty-nester living a perfectly nice life married to a perfectly nice guy. While grocery shopping for her husband’s birthday party, she runs into an old friend, a woman who supported her during the difficult days of early motherhood—and almost ruined her marriage[^4^][2].",
    "genre": "Fiction, Contemporary, Literary Fiction, Adult, Family, Adult Fiction",
    "latest_edition_year": "2024",
    "cover_image_link": "https://upload.wikimedia.org/wikipedia/en/e/e7/David_Nicholls_-_You_Are_Here_-_Cover.jpg"
  },
  {
    "title": "Bear",
    "author": "Julia Phillips",
    "description": "Two sisters in their late 20s care for their ailing mother on a Pacific Northwest island where they were raised. Sam and Elena are desperate for a change, but their jobs catering to wealthy vacationers (one works concessions on the ferry; the other is a bartender at the golf club) barely provide enough to cover their bills[^4^][2].",
    "genre": "Fiction, Literary Fiction, Contemporary, Nature, Adult, Adult Fiction, Family",
    "latest_edition_year": "2024",
    "cover_image_link": "https://m.media-amazon.com/images/I/91+Sa-+PcPL._SL1500_.jpg"
  },
  {
    "title": "You Are Here",
    "author": "David Nicholls",
    "description": "Michael is coming undone. Adrift after his wife's departure, he has begun taking himself on long, solitary walks across the English countryside. Becoming ever more reclusive, he’ll do anything to avoid his empty house. Marnie, meanwhile, is stuck[^5^][20].",
    "genre": "Fiction, Romance, Contemporary, Audiobook, Literary Fiction, Adult Fiction, Contemporary Romance",
    "latest_edition_year": "2024",
    "cover_image_link": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1714074849i/201465867.jpg"
  },
  {
    "title": "The Last Thing He Told Me",
    "author": "Laura Dave",
    "description": "Before Owen Michaels disappears, he smuggles a note to his beloved wife of one year: Protect her. Despite her confusion and fear, Hannah Hall knows exactly to whom the note refers—Owen’s sixteen-year-old daughter, Bailey, who lost her mother tragically as a child[^6^][10].",
    "genre": "Mystery, Fiction, Thriller, Audiobook, Mystery Thriller, Suspense, Contemporary",
    "latest_edition_year": "2021",
    "cover_image_link": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1603034599i/54981009.jpg"
  },
  {
    "title": "The Sanatorium",
    "author": "Sarah Pearse",
    "description": "Half-hidden by forest and overshadowed by threatening peaks, Le Sommet has always been a sinister place. Long plagued by troubling rumors, the former abandoned sanatorium has since been renovated into a five-star minimalist hotel[^7^][5].",
    "genre": "Thriller, Fiction, Mystery, Mystery Thriller, Audiobook, Crime, Horror",
    "latest_edition_year": "2021",
    "cover_image_link": "https://m.media-amazon.com/images/I/91zXBCFQSsL._SL1500_.jpg"
  },
  {
    "title": "No One Is Talking About This",
    "author": "Patricia Lockwood",
    "description": "As this urgent, genre-defying book opens, a woman who has recently been elevated to prominence for her social media posts travels around the world to meet her adoring fans. She is overwhelmed by navigating the new language and etiquette of what she terms \"the portal,\" where she grapples with an unshakable conviction that a vast chorus of voices is now dictating her thoughts[^8^][30].",
    "genre": "Fiction, Contemporary, Literary Fiction, Audiobook, Novels, Fantasy, Humor",
    "latest_edition_year": "2021",
    "cover_image_link": "https://upload.wikimedia.org/wikipedia/en/6/60/No_One_Is_Talking_About_This_%28Patricia_Lockwood%29.png"
  },
  {
    "title": "Project Hail Mary",
    "author": "Andy Weir",
    "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it[^9^][24].",
    "genre": "Science Fiction, Fiction, Audiobook, Fantasy, Space, Adult, Thriller",
    "latest_edition_year": "2021",
    "cover_image_link": "https://upload.wikimedia.org/wikipedia/en/a/ad/Project_Hail_Mary%2C_First_Edition_Cover_%282021%29.jpg"
  }
]
